local L = LibStub("AceLocale-3.0"):NewLocale("CeaphAAI", "ruRU")

if not L then return end

-- Global strings
L["accepted"] = "Приглашение от %s принято"
L["behaviour"] = "Поведение"
L["caai"] = "Ceaphyrel's Auto Accept Invite"
L["declined"] = "Приглашение от %s отклонено"
L["disabled"] = "Отключено"
L["enabled"] = "Включено"
L["filter1"] = " пригласил вас присоединиться к группе"
L["filter2"] = " приглашает вас в группу"
L["listmanagement"] = "Управление списками"
L["loadedversion"] = "Загружено. Версия %s"
L["request"] = "%s запрашивает приглашение!"


-- Behaviour settings
L["acceptall"] = "Принимать все"
L["acceptall-desc"] = "Разрешать приглашения от всех"
L["bn-friends"] = "Разрешить Battle.net"
L["bn-friends-desc"] = "Разрешить авто-приглашения от друзей по Battle.net"
L["everyone"] = "От всех, но отклонять"
L["everyone-desc"] = "Разрешать автоматические приглашения от всех, кроме списка отклоняемых"
L["filter"] = "Системные сообщения фильтра"
L["filter-desc"] = "Системные сообщения фильтра из окна чата"
L["friends"] = "Разрешать друзей"
L["friends-desc"] = "Разрешать автоматические приглашения от друзей"
L["guild"] = "Разрешать Гильдийцев"
L["guild-desc"] = "Разрешать автоматические приглашения от Гильдийцев"
L["guildlowest"] = "Наименьший гильдейский ранг на принятие"
L["guildrank"] = "Гильдийцев по рангу"
L["guildrank-desc"] = "Разрешать автоматические приглашения от гильдийцев рангом выше чем"
L["opt-accept"] = "принимать приглашения"
L["opt-acceptw"] = "принимать приглашения и личные сообщения"
L["opt-decline"] = "отклонять все"
L["opt-declinew"] = "отклонять все и личные сообщения"
L["opt-nothing"] = "ничего не делать / отключить модификацию"
L["suppress"] = "Блокировать сообщения модификации"
L["suppress-desc"] = "Блокировать все сообщения отсылаемые модификацией в окно чата"
L["whattowhisp"] = "Что шепнуть:"
L["whenafk"] = "Когда отошли от компьютера (AFK)"
L["whendnd"] = "Когда не хотите беспокойства (DND)"


-- List management
L["<name>"] = "<имя>"
L["accepting"] = "Принимать приглашения от %s"
L["allowed"] = "  - разрешено"
L["allowlist"] = "Список разрешенных"
L["allowlist-desc"] = "Добавить имя в список автоматического принятия"
L["denied"] = "  - отклонено"
L["denying"] = "Отклоняются приглашения от %s"
L["denylist"] = "Список отклоняемых"
L["denylist-desc"] = "Добавить имя в список автоматического отклонения"
L["list"] = "Список"
L["list-desc"] = "Удалить имя из списка"
L["remove"] = "Удалить"
L["removed"] = " %s  удален из списка"
L["removeinsurance"] = "Вы уверены, что хотите удалить'%s'?"



